## importing libraries

In [57]:
import pandas as pd
import numpy as np
import tensorflow as tf
from tensorflow import keras

## reading dataset

In [70]:
dataset=pd.read_csv('./datasets/Customer_Churn_Modelling.csv')

In [71]:
dataset.head(10)

   RowNumber  CustomerId   Surname  CreditScore   ...   HasCrCard IsActiveMember  EstimatedSalary  Exited
0          1    15634602  Hargrave          619   ...           1              1        101348.88       1
1          2    15647311      Hill          608   ...           0              1        112542.58       0
2          3    15619304      Onio          502   ...           1              0        113931.57       1
3          4    15701354      Boni          699   ...           0              0         93826.63       0
4          5    15737888  Mitchell          850   ...           1              1         79084.10       0
5          6    15574012       Chu          645   ...           1              0        149756.71       1
6          7    15592531  Bartlett          822   ...           1              1         10062.80       0
7          8    15656148    Obinna          376   ...           1              0        119346.88       1
8          9    15792365        He          501   ...           0              1         74940.50       0
9         10    15592389        H?          684   ...           1              1         71725.73       0

[10 rows x 14 columns]

In [72]:
X=dataset.drop(labels=['RowNumber','CustomerId','Surname','Exited'],axis=1)
Y=dataset['Exited']

In [73]:
X.head()

   CreditScore Geography  Gender  Age       ...         NumOfProducts  HasCrCard  IsActiveMember  EstimatedSalary
0          619    France  Female   42       ...                     1          1               1        101348.88
1          608     Spain  Female   41       ...                     1          0               1        112542.58
2          502    France  Female   42       ...                     3          1               0        113931.57
3          699    France  Female   39       ...                     2          0               0         93826.63
4          850     Spain  Female   43       ...                     1          1               1         79084.10

[5 rows x 10 columns]

In [74]:
Y.head()

0    1
1    0
2    1
3    0
4    0
Name: Exited, dtype: int64

### converting categorical data into numbers

In [75]:
from sklearn.preprocessing import LabelEncoder

In [76]:
le=LabelEncoder()

In [77]:
X['Geography']=le.fit_transform(X['Geography'])
X['Gender']=le.fit_transform(X['Gender'])

In [78]:
X.head()

   CreditScore  Geography  Gender  Age       ...         NumOfProducts  HasCrCard  IsActiveMember  EstimatedSalary
0          619          0       0   42       ...                     1          1               1        101348.88
1          608          2       0   41       ...                     1          0               1        112542.58
2          502          0       0   42       ...                     3          1               0        113931.57
3          699          0       0   39       ...                     2          0               0         93826.63
4          850          2       0   43       ...                     1          1               1         79084.10

[5 rows x 10 columns]

In [79]:
Y.head()

0    1
1    0
2    1
3    0
4    0
Name: Exited, dtype: int64

###  one hot encoding for categorical data

In [82]:
X=pd.get_dummies(X,drop_first=True,columns=['Geography'])

In [89]:
X.head()

   CreditScore  Gender  Age  Tenure     ...       IsActiveMember  EstimatedSalary  Geography_1  Geography_2
0          619       0   42       2     ...                    1        101348.88            0            0
1          608       0   41       1     ...                    1        112542.58            0            1
2          502       0   42       8     ...                    0        113931.57            0            0
3          699       0   39       1     ...                    0         93826.63            0            0
4          850       0   43       2     ...                    1         79084.10            0            1

[5 rows x 11 columns]

### feature standardisation and data splitting

In [98]:
from sklearn.preprocessing import StandardScaler 
from sklearn.model_selection import train_test_split

In [102]:
X_train,X_test,Y_train,Y_test=train_test_split(X,Y,test_size=0.2,stratify=Y)

In [92]:
scaler=StandardScaler()

In [103]:
X_train=scaler.fit_transform(X_train)
X_test=scaler.fit_transform(X_test)

## Building neural network using tensorflow

In [105]:
from tensorflow.keras import Sequential
from tensorflow.keras.layers import Dense

In [106]:
model=Sequential()

In [113]:
model.add(Dense(X_train.shape[1],activation='relu',input_dim=X_train.shape[1]))
model.add(Dense(128,activation='relu'))
model.add(Dense(1,activation='sigmoid'))
model.summary()

Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense (Dense)                (None, 11)                132
_________________________________________________________________
dense_1 (Dense)              (None, 128)               1536
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 129
=================================================================
Total params: 1,797
Trainable params: 1,797
Non-trainable params: 0
_________________________________________________________________

In [119]:
model.compile(optimizer='adam',loss='binary_crossentropy',metrics=['accuracy'])

In [129]:
model.fit(X_train,Y_train.as_matrix(),epochs=10)

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Method .as_matrix will be removed in a future version. Use .values instead.
  """Entry point for launching an IPython kernel.

Train on 8000 samples
Epoch 1/10
8000/8000 [==============================] - 3s 347us/sample - loss: 0.4776 - accuracy: 0.7972
Epoch 2/10
8000/8000 [==============================] - 0s 43us/sample - loss: 0.4053 - accuracy: 0.8240
Epoch 3/10
8000/8000 [==============================] - 0s 42us/sample - loss: 0.3761 - accuracy: 0.8401
Epoch 4/10
8000/8000 [==============================] - 0s 47us/sample - loss: 0.3612 - accuracy: 0.8465
Epoch 5/10
8000/8000 [==============================] - 0s 46us/sample - loss: 0.3544 - accuracy: 0.8505
Epoch 6/10
8000/8000 [==============================] - 0s 46us/sample - loss: 0.3485 - accuracy: 0.8533
Epoch 7/10
8000/8000 [==============================] - 0s 44us/sample - loss: 0.3444 - accuracy: 0.8544
Epoch 8/10
8000/8000 [==============================] - 0s 45us/sample - loss: 0.3417 - accuracy: 0.8559
Epoch 9/10
8000/8000 [==============================] - 0s 47us/sample - loss: 0.3378 - accuracy: 0.8591
Epoch 10/10
8000/8000 [==============================] - 0s 48us/sample - loss: 0.3362 - accuracy: 0.8596

In [135]:
_,accuracy=model.evaluate(X_test,Y_test.as_matrix(),verbose=0)

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Method .as_matrix will be removed in a future version. Use .values instead.
  """Entry point for launching an IPython kernel.

In [136]:
print("accuracy of model : ",accuracy)

accuracy of model :  0.845